loadtest1.yml
config:
  target: "ws://127.0.0.1:8081/api"
  phases:
    - duration: 30  # Test for 60 seconds
      arrivalRate: 100 # Every second, add 10 users
      maxVusers: 10000 # And ramp it up to 100 users in total over the 60s period
      name: "Ramping up the load"
    - duration: 60 # Then resume the load test for 120s
      arrivalRate: 100 # With those 100 users we ramped up to in the first phase
      maxVusers: 10000 # And keep it steady at 100 users
      name: "Pushing a constant load"
scenarios:
  - engine: "ws"
    flow:
      - send: '{
					"type": "login",
					"data": {
						"username": "asdf2",
						"password": "asdfasdfasd"
					}
				}'
      - think: 90
# All virtual users finished
# Summary report @ 18:13:00(-0400) 2021-10-11
#   Scenarios launched:  15262
#   Scenarios completed: 15262
#   Requests completed:  15262
#   Mean response/sec: 82.51
#   Response time (msec):
#     min: 0
#     max: 2.6
#     median: 0.1
#     p95: 0.2
#     p99: 0.4
#   Scenario counts:
#     0: 15262 (100%)
#   Codes:
#     0: 15262

# CPU: 30%, mem .1%